app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.restaurant_id = @restaurant.id
        respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "rating", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "Yes@"], ["created_at", "2014-12-29 01:11:14.640993"], ["rating", 5], ["updated_at", "2014-12-29 01:11:14.640993"], ["user_id", 1]]

    def set_restaurant
  @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = ? LIMIT 1  [["id", 2]]